niffler_tests/internal/soap/templates/xml/current_user.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <currentUserRequest xmlns="niffler-userdata">
            <username>{{ username }}</username>
        </currentUserRequest>
    </soapenv:Body>
</soapenv:Envelope>